tap "go-task/tap"
# Simple, modern, secure file encryption
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Official Amazon AWS command-line interface
brew "awscli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Tool to build, change, and version infrastructure
brew "terraform"
# Process YAML documents from the CLI
brew "yq"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# App to build and share containerized applications and microservices
cask "docker"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Menu bar app for managing Kubernetes contexts
cask "kubecontext"
# Kubernetes IDE
cask "lens"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Word processor
cask "microsoft-word"
# Collaboration platform for API development
cask "postman"
# Team communication and collaboration software
cask "slack"
# Text editor for code, markup and prose
cask "sublime-text"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
# Your to-do list for Mac & iOS
mas "Things", id: 904280696