tap "fluxcd/tap"
tap "go-task/tap"
tap "minio/stable"
# Simple, modern, secure file encryption
brew "age"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Official Amazon AWS command-line interface
brew "awscli"
# Load/unload environment variables based on $PWD
brew "direnv"
# Kubernetes package manager
brew "helm"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# LastPass command-line interface tool
brew "lastpass-cli"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Rsync for cloud storage
brew "rclone"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Editor of encrypted files
brew "sops"
# Tool to build, change, and version infrastructure
brew "terraform"
# Linter for Terraform files
brew "tflint"
# Linter for YAML files
brew "yamllint"
# Process YAML documents from the CLI
brew "yq"
# Flux CLI
brew "fluxcd/tap/flux"
# Task runner / simpler Make alternative written in Go
brew "go-task/tap/go-task"
# MinIO Client for object storage and filesystems
brew "minio/stable/mc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Control your Elgato Key Lights
cask "elgato-control-center"
# Assign keys, and then decorate and label them
cask "elgato-stream-deck"
# Calendar software
cask "fantastical"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Menu bar app for managing Kubernetes contexts
cask "kubecontext"
# Password manager
cask "lastpass"
# Kubernetes IDE
cask "lens"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Spreadsheet software
cask "microsoft-excel"
# Word processor
cask "microsoft-word"
# Collaboration platform for API development
cask "postman"
# Text editor for code, markup and prose
cask "sublime-text"
# Control windows and applications right from your trackpad
cask "swish"
# File transfer application
cask "transmit"
# Open-source code editor
cask "visual-studio-code"
# Easy-to-use MQTT client
mas "MQTT Explorer", id: 1455214828
# Your to-do list for Mac & iOS
mas "Things", id: 904280696