{{ if eq .chezmoi.os "darwin" }}
tap "homebrew/bundle"
# --------------------------------------------------------------------------------------------------
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# --------------------------------------------------------------------------------------------------
# GNU File, Shell, and Text utilities
brew "coreutils"
# --------------------------------------------------------------------------------------------------
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# --------------------------------------------------------------------------------------------------
# Load/unload environment variables based on $PWD
brew "direnv"
# --------------------------------------------------------------------------------------------------
# Popular GNU data compression program
brew "gzip"
# --------------------------------------------------------------------------------------------------
# Lightweight and flexible command-line JSON processor
brew "jq"
# --------------------------------------------------------------------------------------------------
# Mac App Store command-line interface
brew "mas"
# --------------------------------------------------------------------------------------------------
# Display directories as trees (with optional color/HTML output)
brew "tree"
# --------------------------------------------------------------------------------------------------
# Executes a program periodically, showing output fullscreen
brew "watch"
# --------------------------------------------------------------------------------------------------
# Internet file retriever
brew "wget"
# --------------------------------------------------------------------------------------------------
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# --------------------------------------------------------------------------------------------------
# Permanent TouchID support for sudo
tap "artginzburg/tap"
brew "artginzburg/tap/sudo-touchid"
# --------------------------------------------------------------------------------------------------

  {{- if .personal }}
  # --------------------------------------------------------------------------------------------------
  # Cross-shell prompt for astronauts
  brew "starship"
  # --------------------------------------------------------------------------------------------------
  # Password manager that keeps all passwords secure behind one password
  cask "1password"
  # --------------------------------------------------------------------------------------------------
  # Command-line helper for the 1Password password manager
  cask "1password-cli"
  # --------------------------------------------------------------------------------------------------
  # Control your Elgato key lights
  cask "elgato-control-center"
  # --------------------------------------------------------------------------------------------------
  # Assign keys, and then decorate and label them
  cask "elgato-stream-deck"
  # --------------------------------------------------------------------------------------------------
  # Calendar software
  cask "fantastical"
  # --------------------------------------------------------------------------------------------------
  # Terminal emulator as alternative to Apple's Terminal app
  cask "iterm2"
  # --------------------------------------------------------------------------------------------------
  # Control windows and applications right from your trackpad
  cask "swish"
  # --------------------------------------------------------------------------------------------------
  # Open-source code editor
  cask "visual-studio-code"
  # --------------------------------------------------------------------------------------------------
  # Fill and save your passwords
  mas "1Password for Safari", id: 1569813296
  # --------------------------------------------------------------------------------------------------
  # Your to-do list for Mac & iOS
  mas "Things", id: 904280696
  # --------------------------------------------------------------------------------------------------
  {{- end }}

  {{- if .work }}
  # --------------------------------------------------------------------------------------------------
  # Meet, chat, call, and collaborate in just one place
  cask "microsoft-teams"
  # --------------------------------------------------------------------------------------------------
  # Team communication and collaboration software
  cask "slack"
  # --------------------------------------------------------------------------------------------------
  # Video communication and virtual meeting platform
  cask "zoom"
  # --------------------------------------------------------------------------------------------------
  # Microsoft Excel
  mas "Microsoft Excel", id: 462058435
  # --------------------------------------------------------------------------------------------------
  # Microsoft OneDrive
  mas "OneDrive", id: 823766827
  # --------------------------------------------------------------------------------------------------
  # Microsoft OneNote
  mas "Microsoft OneNote", id: 784801555
  # --------------------------------------------------------------------------------------------------
  # Microsoft PowerPoint
  mas "Microsoft PowerPoint", id: 462062816
  # --------------------------------------------------------------------------------------------------
  # Microsoft Word
  mas "Microsoft Word", id: 462054704
  # --------------------------------------------------------------------------------------------------
  {{- end }}

  {{- if .devops }}
  # --------------------------------------------------------------------------------------------------
  # Simple, modern, secure file encryption
  brew "age"
  # --------------------------------------------------------------------------------------------------
  # Automate deployment, configuration, and upgrading
  brew "ansible"
  # --------------------------------------------------------------------------------------------------
  # Checks ansible playbooks for practices and behaviour
  brew "ansible-lint"
  # --------------------------------------------------------------------------------------------------
  # Cloudflare Tunnel
  brew "cloudflared"
  # --------------------------------------------------------------------------------------------------
  # Kubernetes package manager
  brew "helm"
  # --------------------------------------------------------------------------------------------------
  # Deploy Kubernetes Helm Charts
  brew "helmfile"
  # --------------------------------------------------------------------------------------------------
  # Flux CLI
  tap "fluxcd/tap"
  brew "fluxcd/tap/flux"
  # --------------------------------------------------------------------------------------------------
  # Task runner / simpler Make alternative written in Go
  tap "go-task/tap"
  brew "go-task/tap/go-task"
  # --------------------------------------------------------------------------------------------------
  # FAST Kubernetes manifests validator, with support for Custom Resources!
  brew "kubeconform"
  # --------------------------------------------------------------------------------------------------
  # Kubernetes command-line interface
  brew "kubernetes-cli"
  # --------------------------------------------------------------------------------------------------
  # Template-free customization of Kubernetes YAML manifests
  brew "kustomize"
  # --------------------------------------------------------------------------------------------------
  # Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
  brew "prettier"
  # --------------------------------------------------------------------------------------------------
  # Framework for managing multi-language pre-commit hooks
  brew "pre-commit"
  # --------------------------------------------------------------------------------------------------
  # Editor of encrypted files
  brew "sops"
  # --------------------------------------------------------------------------------------------------
  # Tail multiple Kubernetes pods & their containers
  brew "stern"
  # --------------------------------------------------------------------------------------------------
  # Configuration helper for talos clusters
  brew "talhelper"
  # --------------------------------------------------------------------------------------------------
  # CLI for out-of-band management of Kubernetes nodes created by Talos
  tap "siderolabs/talos"
  brew "siderolabs/talos/talosctl"
  # --------------------------------------------------------------------------------------------------
  # Tool to build, change, and version infrastructure
  brew "terraform"
  # --------------------------------------------------------------------------------------------------
  # App to build and share containerized applications and microservices
  cask "docker"
  # --------------------------------------------------------------------------------------------------
  # Kubernetes IDE
  cask "lens"
  # --------------------------------------------------------------------------------------------------
  # Administration and development platform for PostgreSQL
  cask "pgadmin4"
  # --------------------------------------------------------------------------------------------------
  {{- end }}

{{- end }}
